//
//  Publications.swift
//  Navigation v2
//
//  Created by Alex Alex on 09.04.2022.
//

import Foundation

let publication1: ViewModelProtocol  = PostTableViewCell.PostModel(
    author: "Ведьмак",
    description: "Компьютерная игра, которая иммет больше всех наград,Главный герой сериала – ведьмак Геральт, охотник за опасными монстрами, угрожающими человеческому роду. Природа его силы исходит из мутаций, которым он подвергся в детстве: Геральт обрёл ускоренный метаболизм, быструю реакцию и нечеловеческую выносливость. Согласно официальному синопсису, сюжет сериала сфокусируется на истории Геральта, пытающегося отыскать своё место в мире, в котором люди часто оказываются более злыми, чем звери.",
    image: "Ведьмак",
    likes: 120,
    views: 240)



let publication2: ViewModelProtocol  = PostTableViewCell.PostModel(
        author: "Нетология. Меняем карьеру через образование.",
        description: "от Hello Word до первого сложного IOS - приложения, В каждом есть сила и талант, чтобы добиваться больших целей. Мы помогаем найти путь развития и реализовать себя через профессию — так, как вам этого хочется,Мы поддерживаем в течение всего обучения. Наши кураторы, эксперты и аспиранты не дают студентам сойти с дистанции. Кроме того, мы помогаем с трудоустройством: собрать портфолио, оформить резюме и пройти собеседование. Лучшие студенты стажируются у наших партнёров. ",
        image: "Нетология",
        likes: 20, views: 40)

let publication3: ViewModelProtocol  = PostTableViewCell.PostModel(
        author: "Университет Синергия",
        description: "Наша миссия — синергия многолетних академических традиций и современных образовательных технологий.Уже более 30 лет мы готовим профессионалов, обладающих набором практических знаний и навыков как для запуска и развития собственного бизнеса, так и для работы на управленческих должностях в крупных компаниях.Наша цель — сделать качественное образование доступным каждому.",
        image: "Synergia",
        likes: 120, views: 240)

let publication4: ViewModelProtocol  = PostTableViewCell.PostModel(
        author: "Смурф",
        description: "Смурфы живут в лесу, в средневековой Европе, приблизительно на побережье западной Ирландии (ландштафт в сериале и комиксах наиболее похожий на тен на полуострове Айверах). Поскольку из 6 Смурфов можно сделать золото, Смурфов постоянно пытаются поймать их неприятели, особенно Гаргамель. Смурфы также должны решить и много других проблем в своей деревне и рады всем помогать, даже своим неприятелям.",
        image: "smurf",
        likes: 500, views: 501)
